{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ORG",
    "10": "I-DATE",
    "11": "B-EVENT",
    "12": "I-EVENT",
    "13": "B-PRODUCT",
    "14": "I-PRODUCT",
    "2": "I-ORG",
    "3": "B-PER",
    "4": "I-PER",
    "5": "B-METRIC",
    "6": "I-METRIC",
    "7": "B-VALUE",
    "8": "I-VALUE",
    "9": "B-DATE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DATE": 9,
    "B-EVENT": 11,
    "B-METRIC": 5,
    "B-ORG": 1,
    "B-PER": 3,
    "B-PRODUCT": 13,
    "B-VALUE": 7,
    "I-DATE": 10,
    "I-EVENT": 12,
    "I-METRIC": 6,
    "I-ORG": 2,
    "I-PER": 4,
    "I-PRODUCT": 14,
    "I-VALUE": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 34932
}
